In [1]:
import pandas as pd

To List all the datasets, which we have

In [2]:
import os
os.listdir('../../datasets')

['.DS_Store',
 '.ipynb_checkpoints',
 '107983_aariclist_25k.csv',
 'crime.h5',
 'customer.csv',
 'customers.csv',
 'example.csv',
 'fifa19.csv',
 'fifa19.zip',
 'file_example_CSV_5000.csv',
 'formula-1-race-data-19502017',
 'Fremont_Bridge_Hourly_Bicycle_Counts_by_Month_October_2012_to_present.csv',
 'google-play-store-apps',
 'IFSC.csv',
 'IMDB_Movie.csv',
 'IMDB_Movie.html',
 'IMDB_Movie.json',
 'IMDB_Movie.xlsx',
 'IMDB_Movie_2columns.csv',
 'IMDB_Movie_3columns.csv',
 'IMDB_Movie_3columns.html',
 'IMDB_Movie_3columns.json',
 'IMDB_Movie_3columns.xls',
 'IMDB_Movie_3columns_without_index.csv',
 'IMDB_Movie_3columns_with_index.csv',
 'IMDB_Movie_Apply.csv',
 'imdb_movie_cleanup.csv',
 'IMDB_Movie_Facebook_Like.csv',
 'IMDB_Movie_Filter.csv',
 'IMDB_Movie_Overview.csv',
 'IMDB_Movie_Sorting.csv',
 'international-airline-passengers.csv',
 'Land Usage Report.csv',
 'Live_Street_Address_Management_SAM_Addresses.csv',
 'lynda.com Courses.csv',
 'MplsStops.csv',
 'multiTimeline.csv',
 'opsd_germany_daily.csv',
 'orders.csv',
 'output-1.csv',
 'pandas_created_file.csv',
 'pivot-tables.xlsx',
 'PJME_hourly.csv',
 'Sales_Data.json',
 'Sales_Data.xlsx',
 'ted_main.csv',
 'Titanic_Desaster.csv',
 'Weather_2012.csv',
 'weight-height.zip',
 'world-happiness-report-2019.csv']

### 1. loading data from csv

In [3]:
df_csv = pd.read_csv('../../datasets/IMDB_Movie_3columns.csv')
df_csv.head()

,movie_title,director_name,title_year
0,Avatar,James Cameron,2009.0
1,Pirates of the Caribbean: At World's End,Gore Verbinski,2007.0
2,Spectre,Sam Mendes,2015.0
3,The Dark Knight Rises,Christopher Nolan,2012.0
4,Star Wars: Episode VII - The Force Awakens ...,Doug Walker,NaN

In [16]:
df_csv2 = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/boot/amis.csv')
df_csv2.head()

   Unnamed: 0  speed  period  warning  pair
0           1     26       1        1     1
1           2     26       1        1     1
2           3     26       1        1     1
3           4     26       1        1     1
4           5     27       1        1     1

### 2. loading data from excel
    - user could choose sheet number incase excel file contain multiple sheet

In [4]:
df_excel = pd.read_excel('../../datasets/IMDB_Movie.xlsx', sheet_name=0)
df_excel

                                 movie_title   director_name  title_year
0                                    Avatar    James Cameron        2009
1  Pirates of the Caribbean: At World's End   Gore Verbinski        2007
2                                   Spectre       Sam Mendes        2015

### 3. loading data from json

In [5]:
df_json = pd.read_json('../../datasets/IMDB_Movie.json')
df_json.head()

                                movie_title   director_name  title_year
0                                    Avatar   James Cameron        2009
1  Pirates of the Caribbean: At World's End  Gore Verbinski        2007
2                                   Spectre      Sam Mendes        2015

### 4. loading data from a table on html web page
    - note that read_html return a list of data table, so to access one talbe need to have table index

In [6]:
df_html = pd.read_html('../../datasets/IMDB_Movie.html')
df_html[0].head()

,Unnamed: 0,movie_title,director_name,title_year
0,0,Avatar,James Cameron,2009.0
1,1,Pirates of the Caribbean: At World's End,Gore Verbinski,2007.0
2,2,Spectre,Sam Mendes,2015.0

In [7]:
df_html

[   Unnamed: 0                               movie_title   director_name  \
 0           0                                    Avatar   James Cameron
 1           1  Pirates of the Caribbean: At World's End  Gore Verbinski
 2           2                                   Spectre      Sam Mendes

    title_year
 0      2009.0
 1      2007.0
 2      2015.0  ]

### 5. loading from a python dictionary
    - key become columns name
    - value become row data

In [8]:
studentData = {
    'name' : ['jack', 'Riti', 'Aadi'],
    'age' : [34, 30, 16],
    'city' : ['Sydney', 'Delhi', 'New york']
}

df_dic = pd.DataFrame(studentData)
df_dic

   name  age      city
0  jack   34    Sydney
1  Riti   30     Delhi
2  Aadi   16  New york

In [9]:
# loading data from coinmarketcap
df_cmc = pd.read_html('http://coinmarketcap.com')
df_cmc

[Empty DataFrame
 Columns: [Rank, Name, Market Cap, Price, Volume (24h), Circulating Supply, Change (24h), Price Graph (7d), Unnamed: 8]
 Index: [],
 Empty DataFrame
 Columns: [Rank, Name]
 Index: [],
     Rank           Name        Market Cap      Price     Volume (24h)  \
 0      1        Bitcoin  $170,493,221,862  $9,251.14  $16,687,215,503
 1      2       Ethereum   $26,819,325,865    $240.08   $7,395,988,262
 2      3         Tether    $9,175,000,106  $0.998586  $19,603,436,406
 3      4            XRP    $8,915,935,425  $0.201455   $1,229,144,011
 4      5   Bitcoin Cash    $4,380,820,482    $237.33   $1,131,724,293
 ..   ...            ...               ...        ...              ...
 95    96        Stratis       $65,147,396  $0.652311      $25,392,392
 96    97  KuCoin Shares       $64,262,694  $0.790923       $5,173,426
 97    98      SwissBorg       $62,136,115  $0.086963         $805,571
 98    99         Energi       $60,707,422      $1.97       $1,348,089
 99   100          Zcoin       $60,042,658      $5.71      $30,160,886

       Circulating Supply Change (24h)  Price Graph (7d)  Unnamed: 8
 0         18,429,437 BTC        0.29%               NaN         NaN
 1        111,707,931 ETH       -0.18%               NaN         NaN
 2   9,187,991,663 USDT *       -0.27%               NaN         NaN
 3   44,257,803,618 XRP *        0.88%               NaN         NaN
 4         18,458,750 BCH        0.13%               NaN         NaN
 ..                   ...          ...               ...         ...
 95    99,871,702 STRAT *        9.79%               NaN         NaN
 96      81,250,284 KCS *       -2.04%               NaN         NaN
 97    714,514,612 CHSB *       -4.11%               NaN         NaN
 98        30,793,852 NRG       -1.26%               NaN         NaN
 99        10,522,194 XZC       18.20%               NaN         NaN

 [100 rows x 9 columns]]

In [10]:
len(df_cmc)

3

In [13]:
df_cmc[0]

Empty DataFrame
Columns: [Rank, Name, Market Cap, Price, Volume (24h), Circulating Supply, Change (24h), Price Graph (7d), Unnamed: 8]
Index: []

In [14]:
df_cmc[1]

Empty DataFrame
Columns: [Rank, Name]
Index: []

In [15]:
df_cmc[2]

,Rank,Name,Market Cap,Price,Volume (24h),Circulating Supply,Change (24h),Price Graph (7d),Unnamed: 8
0,1,Bitcoin,"$170,493,221,862","$9,251.14","$16,687,215,503","18,429,437 BTC",0.29%,NaN,NaN
1,2,Ethereum,"$26,819,325,865",$240.08,"$7,395,988,262","111,707,931 ETH",-0.18%,NaN,NaN
2,3,Tether,"$9,175,000,106",$0.998586,"$19,603,436,406","9,187,991,663 USDT *",-0.27%,NaN,NaN
3,4,XRP,"$8,915,935,425",$0.201455,"$1,229,144,011","44,257,803,618 XRP *",0.88%,NaN,NaN
4,5,Bitcoin Cash,"$4,380,820,482",$237.33,"$1,131,724,293","18,458,750 BCH",0.13%,NaN,NaN
...,...,...,...,...,...,...,...,...,...
95,96,Stratis,"$65,147,396",$0.652311,"$25,392,392","99,871,702 STRAT *",9.79%,NaN,NaN
96,97,KuCoin Shares,"$64,262,694",$0.790923,"$5,173,426","81,250,284 KCS *",-2.04%,NaN,NaN
97,98,SwissBorg,"$62,136,115",$0.086963,"$805,571","714,514,612 CHSB *",-4.11%,NaN,NaN
98,99,Energi,"$60,707,422",$1.97,"$1,348,089","30,793,852 NRG",-1.26%,NaN,NaN
99,100,Zcoin,"$60,042,658",$5.71,"$30,160,886","10,522,194 XZC",18.20%,NaN,NaN

In [11]:
df_cmc_table = df_cmc[2][['Name', 'Market Cap', 'Price', 'Volume (24h)', 'Circulating Supply', 'Change (24h)']]
df_cmc_table.head(3)

,Name,Market Cap,Price,Volume (24h),Circulating Supply,Change (24h)
0,Bitcoin,"$170,493,221,862","$9,251.14","$16,687,215,503","18,429,437 BTC",0.29%
1,Ethereum,"$26,819,325,865",$240.08,"$7,395,988,262","111,707,931 ETH",-0.18%
2,Tether,"$9,175,000,106",$0.998586,"$19,603,436,406","9,187,991,663 USDT *",-0.27%

__NOTE:__

        when loading large dataset with python dataframe, the best practices are 
        a. To load in chucks
        b. filter out unwanted columns 
        c. optimizing the memory usage with using astype() for the columns